
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.minio.local_file.python_user_credentials will be created
  + resource "local_file" "python_user_credentials" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "/home/rpi_user/Projects/football_graphs/Secret/python_user"
      + id                   = (known after apply)
    }

  # module.minio.local_file.spark_user_credentials will be created
  + resource "local_file" "spark_user_credentials" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "/home/rpi_user/Projects/football_graphs/Secret/spark_user"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

<!-- Sticky Pull Request Comment -->